{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "BlipForConditionalGeneration",
    "parent_library": "transformers.models.blip.modeling_blip"
  },
  "base_model_name_or_path": "Salesforce/blip-image-captioning-base",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "self_attn.projection",
    "self.key",
    "self.query",
    "mlp.fc1",
    "output.dense",
    "self_attn.qkv",
    "self.value",
    "mlp.fc2"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}